graph(%self.1 : ClassType<robert>,
      %tokens.1 : Long(*)):
  %4 : bool = prim::Constant[value=1]()
  %5 : bool = prim::Constant[value=0]()
  %8 : None = prim::Constant()
  %10 : int = prim::Constant[value=1]()
  %11 : int = prim::Constant[value=0]()
  %12 : int = prim::Constant[value=-1]()
  %14 : float = prim::Constant[value=1e-05]()
  %15 : float = prim::Constant[value=0.1]()
  %tokens0.1 : Long(*, *) = aten::unsqueeze(%tokens.1, %11)
  %25 : ClassType<encoder> = prim::GetAttr[name="encoder"](%self.1)
  %26 : int = prim::GetAttr[name="padding_idx"](%25)
  %padding_mask.1 : BoolTensor = aten::eq(%tokens0.1, %26)
  %3072 : ClassType<token_embedding> = prim::GetAttr[name="token_embedding"](%25)
  %3073 : Float(*, *) = prim::GetAttr[name="weight"](%3072)
  %embedded.1 : Tensor = aten::embedding(%3073, %tokens0.1, %10, %5, %5)
  %48 : ClassType<positional_embedding> = prim::GetAttr[name="positional_embedding"](%25)
  %49 : int = prim::GetAttr[name="padding_idx"](%48)
  %50 : BoolTensor = aten::ne(%tokens0.1, %49)
  %masked.1 : LongTensor = aten::_cast_Long(%50, %5)
  %52 : Tensor = aten::cumsum(%masked.1, %10, %8)
  %3074 : Tensor = aten::mul(%52, %masked.1)
  %positions.1 : Tensor = aten::add(%3074, %49, %10)
  %3077 : ClassType<embedding> = prim::GetAttr[name="embedding"](%48)
  %3078 : Float(*, *) = prim::GetAttr[name="weight"](%3077)
  %embedded_positions.1 : Tensor = aten::embedding(%3078, %positions.1, %10, %5, %5)
  %3079 : ClassType<embedding_layer_norm> = prim::GetAttr[name="embedding_layer_norm"](%25)
  %3081 : Tensor = aten::add(%embedded.1, %embedded_positions.1, %10)
  %3082 : Float(*) = prim::GetAttr[name="weight"](%3079)
  %3083 : Float(*) = prim::GetAttr[name="bias"](%3079)
  %3084 : int[] = prim::Constant[value=[768]]()
  %normed.1 : Tensor = aten::layer_norm(%3081, %3084, %3082, %3083, %14, %4)
  %3088 : ClassType<dropout> = prim::GetAttr[name="dropout"](%25)
  %3089 : bool = prim::GetAttr[name="training"](%3088)
  %normed0.2 : Tensor = aten::dropout(%normed.1, %15, %3089)
  %89 : Tensor = aten::unsqueeze(%padding_mask.1, %12)
  %padded_normed.1 : Tensor = prim::FusionGroup_0(%normed0.2, %89)
  %encoded11.1 : Tensor, %encoded10.1 : Tensor, %encoded9.1 : Tensor, %encoded8.1 : Tensor, %encoded7.1 : Tensor, %encoded6.1 : Tensor, %encoded5.1 : Tensor, %encoded4.1 : Tensor, %encoded3.1 : Tensor, %encoded2.1 : Tensor, %encoded1.1 : Tensor, %encoded0.1 : Tensor, %encoded.1 : Tensor = glow::FusionGroup_1(%padding_mask.1, %25, %padded_normed.1)
  %all_layers.1 : Tensor[] = prim::ListConstruct(%encoded.1)
  %314 : Tensor[] = aten::append(%all_layers.1, %encoded0.1)
  %520 : Tensor[] = aten::append(%all_layers.1, %encoded1.1)
  %726 : Tensor[] = aten::append(%all_layers.1, %encoded2.1)
  %932 : Tensor[] = aten::append(%all_layers.1, %encoded3.1)
  %1138 : Tensor[] = aten::append(%all_layers.1, %encoded4.1)
  %1344 : Tensor[] = aten::append(%all_layers.1, %encoded5.1)
  %1550 : Tensor[] = aten::append(%all_layers.1, %encoded6.1)
  %1756 : Tensor[] = aten::append(%all_layers.1, %encoded7.1)
  %1962 : Tensor[] = aten::append(%all_layers.1, %encoded8.1)
  %2168 : Tensor[] = aten::append(%all_layers.1, %encoded9.1)
  %2374 : Tensor[] = aten::append(%all_layers.1, %encoded10.1)
  %2580 : Tensor[] = aten::append(%all_layers.1, %encoded11.1)
  %last_layer.1 : Tensor = aten::__getitem__(%all_layers.1, %12)
  %2582 : Tensor = aten::transpose(%last_layer.1, %11, %10)
  return (%2582)
with prim::FusionGroup_0 = graph(%0 : Tensor,
      %8 : Tensor):
  %4 : int = prim::Constant[value=1]()
  %9 : Tensor = aten::type_as(%8, %0)
  %7 : Tensor = aten::neg(%9)
  %5 : Tensor = aten::add(%7, %4, %4)
  %padded_normed.1 : Tensor = aten::mul(%0, %5)
  return (%padded_normed.1)
with glow::FusionGroup_1 = graph(%208 : BoolTensor,
      %2577 : ClassType<encoder>,
      %2579 : Tensor):
  %2580 : int = prim::Constant[value=0]()
  %2581 : int = prim::Constant[value=1]()
  %encoded.1 : Tensor = aten::transpose(%2579, %2580, %2581)
  %2578 : ClassType<layers> = prim::GetAttr[name="layers"](%2577)
  %2576 : ClassType<_0> = prim::GetAttr[name="0"](%2578)
  %2575 : ClassType<_1> = prim::GetAttr[name="1"](%2578)
  %2574 : ClassType<_2> = prim::GetAttr[name="2"](%2578)
  %2573 : ClassType<_3> = prim::GetAttr[name="3"](%2578)
  %2572 : ClassType<_4> = prim::GetAttr[name="4"](%2578)
  %2571 : ClassType<_5> = prim::GetAttr[name="5"](%2578)
  %2570 : ClassType<_6> = prim::GetAttr[name="6"](%2578)
  %2569 : ClassType<_7> = prim::GetAttr[name="7"](%2578)
  %2568 : ClassType<_8> = prim::GetAttr[name="8"](%2578)
  %2567 : ClassType<_9> = prim::GetAttr[name="9"](%2578)
  %2566 : ClassType<_10> = prim::GetAttr[name="10"](%2578)
  %2565 : ClassType<_11> = prim::GetAttr[name="11"](%2578)
  %2563 : ClassType<attention> = prim::GetAttr[name="attention"](%2576)
  %2562 : int[] = aten::size(%encoded.1)
  %tgt_len.1 : int, %bsz.1 : int, %embed_dim.1 : int = prim::ListUnpack(%2562)
  %2557 : int[] = aten::size(%208)
  %mask_bsz.1 : int, %src_len.1 : int = prim::ListUnpack(%2557)
  %2553 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%2563)
  %2552 : Float(*, *) = prim::GetAttr[name="weight"](%2553)
  %2551 : Float(*) = prim::GetAttr[name="bias"](%2553)
  %2547 : int = prim::Constant[value=2]()
  %2548 : int = prim::Constant[value=1]()
  %projection : Tensor = glow::fused_linear(%encoded.1, %2552, %2551, %2547, %2548)
  %2542 : Tensor, %2543 : Tensor, %2544 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection)
  %2540 : float = prim::GetAttr[name="scaling"](%2563)
  %q0.1 : Tensor = aten::mul_(%2542, %2540)
  %2535 : int = prim::Constant[value=0]()
  %2536 : Tensor = aten::contiguous(%q0.1, %2535)
  %2533 : int = prim::GetAttr[name="num_heads"](%2563)
  %2532 : int = aten::mul(%bsz.1, %2533)
  %2531 : int = prim::GetAttr[name="head_dim"](%2563)
  %2530 : int[] = prim::ListConstruct(%tgt_len.1, %2532, %2531)
  %2529 : Tensor(*, *, *) = aten::view(%2536, %2530)
  %2524 : int = prim::Constant[value=0]()
  %2525 : int = prim::Constant[value=1]()
  %q1.1 : Tensor(*, *, *) = aten::transpose(%2529, %2524, %2525)
  %2521 : int = prim::Constant[value=0]()
  %2522 : Tensor = aten::contiguous(%2543, %2521)
  %2518 : int = prim::Constant[value=-1]()
  %2519 : int[] = prim::ListConstruct(%2518, %2532, %2531)
  %2517 : Tensor(*, *, *) = aten::view(%2522, %2519)
  %2512 : int = prim::Constant[value=0]()
  %2513 : int = prim::Constant[value=1]()
  %k0.1 : Tensor(*, *, *) = aten::transpose(%2517, %2512, %2513)
  %2509 : int = prim::Constant[value=0]()
  %2510 : Tensor = aten::contiguous(%2544, %2509)
  %2505 : int = prim::Constant[value=-1]()
  %2507 : int[] = prim::ListConstruct(%2505, %2532, %2531)
  %2504 : Tensor(*, *, *) = aten::view(%2510, %2507)
  %2499 : int = prim::Constant[value=0]()
  %2500 : int = prim::Constant[value=1]()
  %v0.1 : Tensor(*, *, *) = aten::transpose(%2504, %2499, %2500)
  %2495 : int = prim::Constant[value=1]()
  %2496 : int = prim::Constant[value=2]()
  %2497 : Tensor(*, *, *) = aten::transpose(%k0.1, %2495, %2496)
  %attn_weights.1 : Tensor(*, *, *) = aten::bmm(%q1.1, %2497)
  %2490 : int[] = prim::ListConstruct(%bsz.1, %2533, %tgt_len.1, %src_len.1)
  %attn_weights0.1 : Tensor(*, *, *, *) = aten::view(%attn_weights.1, %2490)
  %2484 : int = prim::Constant[value=1]()
  %2485 : Tensor = aten::unsqueeze(%208, %2484)
  %2482 : int = prim::Constant[value=2]()
  %2483 : Tensor = aten::unsqueeze(%2485, %2482)
  %2479 : float = prim::Constant[value=-inf]()
  %attn_weights1.1 : Tensor = aten::masked_fill(%attn_weights0.1, %2483, %2479)
  %2477 : int[] = prim::ListConstruct(%2532, %tgt_len.1, %src_len.1)
  %attn_weights2.1 : Tensor(*, *, *) = aten::view(%attn_weights1.1, %2477)
  %2469 : int = prim::Constant[value=-1]()
  %2470 : int = prim::Constant[value=6]()
  %ret.2 : Tensor = aten::softmax(%attn_weights2.1, %2469, %2470)
  %attn_weights3.1 : Tensor = aten::type_as(%ret.2, %attn_weights2.1)
  %2465 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2563)
  %2464 : bool = prim::GetAttr[name="training"](%2465)
  %2460 : float = prim::Constant[value=0.1]()
  %attn_weights4.2 : Tensor = aten::dropout(%attn_weights3.1, %2460, %2464)
  %attn.1 : Tensor(*, *, *) = aten::bmm(%attn_weights4.2, %v0.1)
  %2453 : int = prim::Constant[value=0]()
  %2454 : int = prim::Constant[value=1]()
  %2455 : Tensor(*, *, *) = aten::transpose(%attn.1, %2453, %2454)
  %2450 : int = prim::Constant[value=0]()
  %2451 : Tensor(*, *, *) = aten::contiguous(%2455, %2450)
  %2448 : int[] = prim::ListConstruct(%tgt_len.1, %bsz.1, %embed_dim.1)
  %attn0.1 : Tensor(*, *, *) = aten::view(%2451, %2448)
  %2441 : ClassType<output_projection> = prim::GetAttr[name="output_projection"](%2563)
  %2439 : Float(*, *) = prim::GetAttr[name="weight"](%2441)
  %2438 : Float(*) = prim::GetAttr[name="bias"](%2441)
  %2436 : Float(*, *) = aten::t(%2439)
  %output1.1 : Tensor(*, *, *) = aten::matmul(%attn0.1, %2436)
  %2430 : int = prim::Constant[value=1]()
  %output2.1 : Tensor = aten::add_(%output1.1, %2438, %2430)
  %2427 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2576)
  %2426 : bool = prim::GetAttr[name="training"](%2427)
  %2422 : float = prim::Constant[value=0.1]()
  %attention0.2 : Tensor = aten::dropout(%output2.1, %2422, %2426)
  %2419 : int = prim::Constant[value=1]()
  %biased_input.1 : Tensor = aten::add(%encoded.1, %attention0.2, %2419)
  %2416 : ClassType<attention_layer_norm> = prim::GetAttr[name="attention_layer_norm"](%2576)
  %2415 : Float(*) = prim::GetAttr[name="weight"](%2416)
  %2414 : Float(*) = prim::GetAttr[name="bias"](%2416)
  %2407 : int[] = prim::Constant[value=[768]]()
  %2410 : float = prim::Constant[value=1e-05]()
  %2411 : bool = prim::Constant[value=1]()
  %biased_input0.1 : Tensor = aten::layer_norm(%biased_input.1, %2407, %2415, %2414, %2410, %2411)
  %2405 : ClassType<residual_mlp> = prim::GetAttr[name="residual_mlp"](%2576)
  %2404 : ClassType<mlp> = prim::GetAttr[name="mlp"](%2405)
  %2402 : ClassType<_0> = prim::GetAttr[name="0"](%2404)
  %2401 : ClassType<_2> = prim::GetAttr[name="2"](%2404)
  %2400 : ClassType<_3> = prim::GetAttr[name="3"](%2404)
  %2399 : ClassType<_4> = prim::GetAttr[name="4"](%2404)
  %2397 : Float(*, *) = prim::GetAttr[name="weight"](%2402)
  %2396 : Float(*) = prim::GetAttr[name="bias"](%2402)
  %2392 : int = prim::Constant[value=2]()
  %2393 : int = prim::Constant[value=1]()
  %input1 : Tensor = glow::fused_linear(%biased_input0.1, %2397, %2396, %2392, %2393)
  %2388 : bool = prim::Constant[value=0]()
  %2389 : FloatTensor = aten::_cast_Float(%input1, %2388)
  %2387 : FloatTensor = aten::gelu(%2389)
  %input2.1 : Tensor = aten::type_as(%2387, %input1)
  %2382 : bool = prim::GetAttr[name="training"](%2401)
  %2378 : float = prim::Constant[value=0.1]()
  %input3.2 : Tensor = aten::dropout(%input2.1, %2378, %2382)
  %2376 : Float(*, *) = prim::GetAttr[name="weight"](%2400)
  %2375 : Float(*) = prim::GetAttr[name="bias"](%2400)
  %2371 : int = prim::Constant[value=2]()
  %2372 : int = prim::Constant[value=1]()
  %input4 : Tensor = glow::fused_linear(%input3.2, %2376, %2375, %2371, %2372)
  %2367 : bool = prim::GetAttr[name="training"](%2399)
  %2363 : float = prim::Constant[value=0.1]()
  %bias7.2 : Tensor = aten::dropout(%input4, %2363, %2367)
  %2360 : int = prim::Constant[value=1]()
  %biased.1 : Tensor = aten::add(%biased_input0.1, %bias7.2, %2360)
  %2357 : ClassType<final_layer_norm> = prim::GetAttr[name="final_layer_norm"](%2576)
  %2355 : Float(*) = prim::GetAttr[name="weight"](%2357)
  %2354 : Float(*) = prim::GetAttr[name="bias"](%2357)
  %2347 : int[] = prim::Constant[value=[768]]()
  %2350 : float = prim::Constant[value=1e-05]()
  %2351 : bool = prim::Constant[value=1]()
  %encoded0.1 : Tensor = aten::layer_norm(%biased.1, %2347, %2355, %2354, %2350, %2351)
  %2345 : ClassType<attention> = prim::GetAttr[name="attention"](%2575)
  %2344 : int[] = aten::size(%encoded0.1)
  %tgt_len0.1 : int, %bsz0.1 : int, %embed_dim0.1 : int = prim::ListUnpack(%2344)
  %2339 : int[] = aten::size(%208)
  %mask_bsz0.1 : int, %src_len0.1 : int = prim::ListUnpack(%2339)
  %2335 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%2345)
  %2334 : Float(*, *) = prim::GetAttr[name="weight"](%2335)
  %2333 : Float(*) = prim::GetAttr[name="bias"](%2335)
  %2329 : int = prim::Constant[value=2]()
  %2330 : int = prim::Constant[value=1]()
  %projection0 : Tensor = glow::fused_linear(%encoded0.1, %2334, %2333, %2329, %2330)
  %2324 : Tensor, %2325 : Tensor, %2326 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection0)
  %2322 : float = prim::GetAttr[name="scaling"](%2345)
  %q3.1 : Tensor = aten::mul_(%2324, %2322)
  %2317 : int = prim::Constant[value=0]()
  %2318 : Tensor = aten::contiguous(%q3.1, %2317)
  %2315 : int = prim::GetAttr[name="num_heads"](%2345)
  %2314 : int = aten::mul(%bsz0.1, %2315)
  %2313 : int = prim::GetAttr[name="head_dim"](%2345)
  %2312 : int[] = prim::ListConstruct(%tgt_len0.1, %2314, %2313)
  %2311 : Tensor(*, *, *) = aten::view(%2318, %2312)
  %2306 : int = prim::Constant[value=0]()
  %2307 : int = prim::Constant[value=1]()
  %q4.1 : Tensor(*, *, *) = aten::transpose(%2311, %2306, %2307)
  %2303 : int = prim::Constant[value=0]()
  %2304 : Tensor = aten::contiguous(%2325, %2303)
  %2300 : int = prim::Constant[value=-1]()
  %2301 : int[] = prim::ListConstruct(%2300, %2314, %2313)
  %2299 : Tensor(*, *, *) = aten::view(%2304, %2301)
  %2294 : int = prim::Constant[value=0]()
  %2295 : int = prim::Constant[value=1]()
  %k2.1 : Tensor(*, *, *) = aten::transpose(%2299, %2294, %2295)
  %2291 : int = prim::Constant[value=0]()
  %2292 : Tensor = aten::contiguous(%2326, %2291)
  %2287 : int = prim::Constant[value=-1]()
  %2289 : int[] = prim::ListConstruct(%2287, %2314, %2313)
  %2286 : Tensor(*, *, *) = aten::view(%2292, %2289)
  %2281 : int = prim::Constant[value=0]()
  %2282 : int = prim::Constant[value=1]()
  %v2.1 : Tensor(*, *, *) = aten::transpose(%2286, %2281, %2282)
  %2277 : int = prim::Constant[value=1]()
  %2278 : int = prim::Constant[value=2]()
  %2279 : Tensor(*, *, *) = aten::transpose(%k2.1, %2277, %2278)
  %attn_weights5.1 : Tensor(*, *, *) = aten::bmm(%q4.1, %2279)
  %2272 : int[] = prim::ListConstruct(%bsz0.1, %2315, %tgt_len0.1, %src_len0.1)
  %attn_weights6.1 : Tensor(*, *, *, *) = aten::view(%attn_weights5.1, %2272)
  %2266 : float = prim::Constant[value=-inf]()
  %attn_weights7.1 : Tensor = aten::masked_fill(%attn_weights6.1, %2483, %2266)
  %2264 : int[] = prim::ListConstruct(%2314, %tgt_len0.1, %src_len0.1)
  %attn_weights8.1 : Tensor(*, *, *) = aten::view(%attn_weights7.1, %2264)
  %2256 : int = prim::Constant[value=-1]()
  %2257 : int = prim::Constant[value=6]()
  %ret0.2 : Tensor = aten::softmax(%attn_weights8.1, %2256, %2257)
  %attn_weights9.1 : Tensor = aten::type_as(%ret0.2, %attn_weights8.1)
  %2252 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2345)
  %2251 : bool = prim::GetAttr[name="training"](%2252)
  %2247 : float = prim::Constant[value=0.1]()
  %attn_weights10.2 : Tensor = aten::dropout(%attn_weights9.1, %2247, %2251)
  %attn1.1 : Tensor(*, *, *) = aten::bmm(%attn_weights10.2, %v2.1)
  %2240 : int = prim::Constant[value=0]()
  %2241 : int = prim::Constant[value=1]()
  %2242 : Tensor(*, *, *) = aten::transpose(%attn1.1, %2240, %2241)
  %2237 : int = prim::Constant[value=0]()
  %2238 : Tensor(*, *, *) = aten::contiguous(%2242, %2237)
  %2235 : int[] = prim::ListConstruct(%tgt_len0.1, %bsz0.1, %embed_dim0.1)
  %attn2.1 : Tensor(*, *, *) = aten::view(%2238, %2235)
  %2228 : ClassType<output_projection> = prim::GetAttr[name="output_projection"](%2345)
  %2226 : Float(*, *) = prim::GetAttr[name="weight"](%2228)
  %2225 : Float(*) = prim::GetAttr[name="bias"](%2228)
  %2223 : Float(*, *) = aten::t(%2226)
  %output9.1 : Tensor(*, *, *) = aten::matmul(%attn2.1, %2223)
  %2217 : int = prim::Constant[value=1]()
  %output10.1 : Tensor = aten::add_(%output9.1, %2225, %2217)
  %2214 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2575)
  %2213 : bool = prim::GetAttr[name="training"](%2214)
  %2209 : float = prim::Constant[value=0.1]()
  %attention2.2 : Tensor = aten::dropout(%output10.1, %2209, %2213)
  %2206 : int = prim::Constant[value=1]()
  %biased_input1.1 : Tensor = aten::add(%encoded0.1, %attention2.2, %2206)
  %2203 : ClassType<attention_layer_norm> = prim::GetAttr[name="attention_layer_norm"](%2575)
  %2202 : Float(*) = prim::GetAttr[name="weight"](%2203)
  %2201 : Float(*) = prim::GetAttr[name="bias"](%2203)
  %2194 : int[] = prim::Constant[value=[768]]()
  %2197 : float = prim::Constant[value=1e-05]()
  %2198 : bool = prim::Constant[value=1]()
  %biased_input2.1 : Tensor = aten::layer_norm(%biased_input1.1, %2194, %2202, %2201, %2197, %2198)
  %2192 : ClassType<residual_mlp> = prim::GetAttr[name="residual_mlp"](%2575)
  %2191 : ClassType<mlp> = prim::GetAttr[name="mlp"](%2192)
  %2189 : ClassType<_0> = prim::GetAttr[name="0"](%2191)
  %2188 : ClassType<_2> = prim::GetAttr[name="2"](%2191)
  %2187 : ClassType<_3> = prim::GetAttr[name="3"](%2191)
  %2186 : ClassType<_4> = prim::GetAttr[name="4"](%2191)
  %2184 : Float(*, *) = prim::GetAttr[name="weight"](%2189)
  %2183 : Float(*) = prim::GetAttr[name="bias"](%2189)
  %2179 : int = prim::Constant[value=2]()
  %2180 : int = prim::Constant[value=1]()
  %input5 : Tensor = glow::fused_linear(%biased_input2.1, %2184, %2183, %2179, %2180)
  %2175 : bool = prim::Constant[value=0]()
  %2176 : FloatTensor = aten::_cast_Float(%input5, %2175)
  %2174 : FloatTensor = aten::gelu(%2176)
  %input6.1 : Tensor = aten::type_as(%2174, %input5)
  %2169 : bool = prim::GetAttr[name="training"](%2188)
  %2165 : float = prim::Constant[value=0.1]()
  %input7.2 : Tensor = aten::dropout(%input6.1, %2165, %2169)
  %2163 : Float(*, *) = prim::GetAttr[name="weight"](%2187)
  %2162 : Float(*) = prim::GetAttr[name="bias"](%2187)
  %2158 : int = prim::Constant[value=2]()
  %2159 : int = prim::Constant[value=1]()
  %input8 : Tensor = glow::fused_linear(%input7.2, %2163, %2162, %2158, %2159)
  %2154 : bool = prim::GetAttr[name="training"](%2186)
  %2150 : float = prim::Constant[value=0.1]()
  %bias16.2 : Tensor = aten::dropout(%input8, %2150, %2154)
  %2147 : int = prim::Constant[value=1]()
  %biased0.1 : Tensor = aten::add(%biased_input2.1, %bias16.2, %2147)
  %2144 : ClassType<final_layer_norm> = prim::GetAttr[name="final_layer_norm"](%2575)
  %2142 : Float(*) = prim::GetAttr[name="weight"](%2144)
  %2141 : Float(*) = prim::GetAttr[name="bias"](%2144)
  %2134 : int[] = prim::Constant[value=[768]]()
  %2137 : float = prim::Constant[value=1e-05]()
  %2138 : bool = prim::Constant[value=1]()
  %encoded1.1 : Tensor = aten::layer_norm(%biased0.1, %2134, %2142, %2141, %2137, %2138)
  %2132 : ClassType<attention> = prim::GetAttr[name="attention"](%2574)
  %2131 : int[] = aten::size(%encoded1.1)
  %tgt_len1.1 : int, %bsz1.1 : int, %embed_dim1.1 : int = prim::ListUnpack(%2131)
  %2126 : int[] = aten::size(%208)
  %mask_bsz1.1 : int, %src_len1.1 : int = prim::ListUnpack(%2126)
  %2122 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%2132)
  %2121 : Float(*, *) = prim::GetAttr[name="weight"](%2122)
  %2120 : Float(*) = prim::GetAttr[name="bias"](%2122)
  %2116 : int = prim::Constant[value=2]()
  %2117 : int = prim::Constant[value=1]()
  %projection1 : Tensor = glow::fused_linear(%encoded1.1, %2121, %2120, %2116, %2117)
  %2111 : Tensor, %2112 : Tensor, %2113 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection1)
  %2109 : float = prim::GetAttr[name="scaling"](%2132)
  %q6.1 : Tensor = aten::mul_(%2111, %2109)
  %2104 : int = prim::Constant[value=0]()
  %2105 : Tensor = aten::contiguous(%q6.1, %2104)
  %2102 : int = prim::GetAttr[name="num_heads"](%2132)
  %2101 : int = aten::mul(%bsz1.1, %2102)
  %2100 : int = prim::GetAttr[name="head_dim"](%2132)
  %2099 : int[] = prim::ListConstruct(%tgt_len1.1, %2101, %2100)
  %2098 : Tensor(*, *, *) = aten::view(%2105, %2099)
  %2093 : int = prim::Constant[value=0]()
  %2094 : int = prim::Constant[value=1]()
  %q7.1 : Tensor(*, *, *) = aten::transpose(%2098, %2093, %2094)
  %2090 : int = prim::Constant[value=0]()
  %2091 : Tensor = aten::contiguous(%2112, %2090)
  %2087 : int = prim::Constant[value=-1]()
  %2088 : int[] = prim::ListConstruct(%2087, %2101, %2100)
  %2086 : Tensor(*, *, *) = aten::view(%2091, %2088)
  %2081 : int = prim::Constant[value=0]()
  %2082 : int = prim::Constant[value=1]()
  %k4.1 : Tensor(*, *, *) = aten::transpose(%2086, %2081, %2082)
  %2078 : int = prim::Constant[value=0]()
  %2079 : Tensor = aten::contiguous(%2113, %2078)
  %2074 : int = prim::Constant[value=-1]()
  %2076 : int[] = prim::ListConstruct(%2074, %2101, %2100)
  %2073 : Tensor(*, *, *) = aten::view(%2079, %2076)
  %2068 : int = prim::Constant[value=0]()
  %2069 : int = prim::Constant[value=1]()
  %v4.1 : Tensor(*, *, *) = aten::transpose(%2073, %2068, %2069)
  %2064 : int = prim::Constant[value=1]()
  %2065 : int = prim::Constant[value=2]()
  %2066 : Tensor(*, *, *) = aten::transpose(%k4.1, %2064, %2065)
  %attn_weights11.1 : Tensor(*, *, *) = aten::bmm(%q7.1, %2066)
  %2059 : int[] = prim::ListConstruct(%bsz1.1, %2102, %tgt_len1.1, %src_len1.1)
  %attn_weights12.1 : Tensor(*, *, *, *) = aten::view(%attn_weights11.1, %2059)
  %2053 : float = prim::Constant[value=-inf]()
  %attn_weights13.1 : Tensor = aten::masked_fill(%attn_weights12.1, %2483, %2053)
  %2051 : int[] = prim::ListConstruct(%2101, %tgt_len1.1, %src_len1.1)
  %attn_weights14.1 : Tensor(*, *, *) = aten::view(%attn_weights13.1, %2051)
  %2043 : int = prim::Constant[value=-1]()
  %2044 : int = prim::Constant[value=6]()
  %ret1.2 : Tensor = aten::softmax(%attn_weights14.1, %2043, %2044)
  %attn_weights15.1 : Tensor = aten::type_as(%ret1.2, %attn_weights14.1)
  %2039 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2132)
  %2038 : bool = prim::GetAttr[name="training"](%2039)
  %2034 : float = prim::Constant[value=0.1]()
  %attn_weights16.2 : Tensor = aten::dropout(%attn_weights15.1, %2034, %2038)
  %attn3.1 : Tensor(*, *, *) = aten::bmm(%attn_weights16.2, %v4.1)
  %2027 : int = prim::Constant[value=0]()
  %2028 : int = prim::Constant[value=1]()
  %2029 : Tensor(*, *, *) = aten::transpose(%attn3.1, %2027, %2028)
  %2024 : int = prim::Constant[value=0]()
  %2025 : Tensor(*, *, *) = aten::contiguous(%2029, %2024)
  %2022 : int[] = prim::ListConstruct(%tgt_len1.1, %bsz1.1, %embed_dim1.1)
  %attn4.1 : Tensor(*, *, *) = aten::view(%2025, %2022)
  %2015 : ClassType<output_projection> = prim::GetAttr[name="output_projection"](%2132)
  %2013 : Float(*, *) = prim::GetAttr[name="weight"](%2015)
  %2012 : Float(*) = prim::GetAttr[name="bias"](%2015)
  %2010 : Float(*, *) = aten::t(%2013)
  %output17.1 : Tensor(*, *, *) = aten::matmul(%attn4.1, %2010)
  %2004 : int = prim::Constant[value=1]()
  %output18.1 : Tensor = aten::add_(%output17.1, %2012, %2004)
  %2001 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2574)
  %2000 : bool = prim::GetAttr[name="training"](%2001)
  %1996 : float = prim::Constant[value=0.1]()
  %attention4.2 : Tensor = aten::dropout(%output18.1, %1996, %2000)
  %1993 : int = prim::Constant[value=1]()
  %biased_input3.1 : Tensor = aten::add(%encoded1.1, %attention4.2, %1993)
  %1990 : ClassType<attention_layer_norm> = prim::GetAttr[name="attention_layer_norm"](%2574)
  %1989 : Float(*) = prim::GetAttr[name="weight"](%1990)
  %1988 : Float(*) = prim::GetAttr[name="bias"](%1990)
  %1981 : int[] = prim::Constant[value=[768]]()
  %1984 : float = prim::Constant[value=1e-05]()
  %1985 : bool = prim::Constant[value=1]()
  %biased_input4.1 : Tensor = aten::layer_norm(%biased_input3.1, %1981, %1989, %1988, %1984, %1985)
  %1979 : ClassType<residual_mlp> = prim::GetAttr[name="residual_mlp"](%2574)
  %1978 : ClassType<mlp> = prim::GetAttr[name="mlp"](%1979)
  %1976 : ClassType<_0> = prim::GetAttr[name="0"](%1978)
  %1975 : ClassType<_2> = prim::GetAttr[name="2"](%1978)
  %1974 : ClassType<_3> = prim::GetAttr[name="3"](%1978)
  %1973 : ClassType<_4> = prim::GetAttr[name="4"](%1978)
  %1971 : Float(*, *) = prim::GetAttr[name="weight"](%1976)
  %1970 : Float(*) = prim::GetAttr[name="bias"](%1976)
  %1966 : int = prim::Constant[value=2]()
  %1967 : int = prim::Constant[value=1]()
  %input9 : Tensor = glow::fused_linear(%biased_input4.1, %1971, %1970, %1966, %1967)
  %1962 : bool = prim::Constant[value=0]()
  %1963 : FloatTensor = aten::_cast_Float(%input9, %1962)
  %1961 : FloatTensor = aten::gelu(%1963)
  %input10.1 : Tensor = aten::type_as(%1961, %input9)
  %1956 : bool = prim::GetAttr[name="training"](%1975)
  %1952 : float = prim::Constant[value=0.1]()
  %input11.2 : Tensor = aten::dropout(%input10.1, %1952, %1956)
  %1950 : Float(*, *) = prim::GetAttr[name="weight"](%1974)
  %1949 : Float(*) = prim::GetAttr[name="bias"](%1974)
  %1945 : int = prim::Constant[value=2]()
  %1946 : int = prim::Constant[value=1]()
  %input12 : Tensor = glow::fused_linear(%input11.2, %1950, %1949, %1945, %1946)
  %1941 : bool = prim::GetAttr[name="training"](%1973)
  %1937 : float = prim::Constant[value=0.1]()
  %bias25.2 : Tensor = aten::dropout(%input12, %1937, %1941)
  %1934 : int = prim::Constant[value=1]()
  %biased1.1 : Tensor = aten::add(%biased_input4.1, %bias25.2, %1934)
  %1931 : ClassType<final_layer_norm> = prim::GetAttr[name="final_layer_norm"](%2574)
  %1929 : Float(*) = prim::GetAttr[name="weight"](%1931)
  %1928 : Float(*) = prim::GetAttr[name="bias"](%1931)
  %1921 : int[] = prim::Constant[value=[768]]()
  %1924 : float = prim::Constant[value=1e-05]()
  %1925 : bool = prim::Constant[value=1]()
  %encoded2.1 : Tensor = aten::layer_norm(%biased1.1, %1921, %1929, %1928, %1924, %1925)
  %1919 : ClassType<attention> = prim::GetAttr[name="attention"](%2573)
  %1918 : int[] = aten::size(%encoded2.1)
  %tgt_len2.1 : int, %bsz2.1 : int, %embed_dim2.1 : int = prim::ListUnpack(%1918)
  %1913 : int[] = aten::size(%208)
  %mask_bsz2.1 : int, %src_len2.1 : int = prim::ListUnpack(%1913)
  %1909 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%1919)
  %1908 : Float(*, *) = prim::GetAttr[name="weight"](%1909)
  %1907 : Float(*) = prim::GetAttr[name="bias"](%1909)
  %1903 : int = prim::Constant[value=2]()
  %1904 : int = prim::Constant[value=1]()
  %projection2 : Tensor = glow::fused_linear(%encoded2.1, %1908, %1907, %1903, %1904)
  %1898 : Tensor, %1899 : Tensor, %1900 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection2)
  %1896 : float = prim::GetAttr[name="scaling"](%1919)
  %q9.1 : Tensor = aten::mul_(%1898, %1896)
  %1891 : int = prim::Constant[value=0]()
  %1892 : Tensor = aten::contiguous(%q9.1, %1891)
  %1889 : int = prim::GetAttr[name="num_heads"](%1919)
  %1888 : int = aten::mul(%bsz2.1, %1889)
  %1887 : int = prim::GetAttr[name="head_dim"](%1919)
  %1886 : int[] = prim::ListConstruct(%tgt_len2.1, %1888, %1887)
  %1885 : Tensor(*, *, *) = aten::view(%1892, %1886)
  %1880 : int = prim::Constant[value=0]()
  %1881 : int = prim::Constant[value=1]()
  %q10.1 : Tensor(*, *, *) = aten::transpose(%1885, %1880, %1881)
  %1877 : int = prim::Constant[value=0]()
  %1878 : Tensor = aten::contiguous(%1899, %1877)
  %1874 : int = prim::Constant[value=-1]()
  %1875 : int[] = prim::ListConstruct(%1874, %1888, %1887)
  %1873 : Tensor(*, *, *) = aten::view(%1878, %1875)
  %1868 : int = prim::Constant[value=0]()
  %1869 : int = prim::Constant[value=1]()
  %k6.1 : Tensor(*, *, *) = aten::transpose(%1873, %1868, %1869)
  %1865 : int = prim::Constant[value=0]()
  %1866 : Tensor = aten::contiguous(%1900, %1865)
  %1861 : int = prim::Constant[value=-1]()
  %1863 : int[] = prim::ListConstruct(%1861, %1888, %1887)
  %1860 : Tensor(*, *, *) = aten::view(%1866, %1863)
  %1855 : int = prim::Constant[value=0]()
  %1856 : int = prim::Constant[value=1]()
  %v6.1 : Tensor(*, *, *) = aten::transpose(%1860, %1855, %1856)
  %1851 : int = prim::Constant[value=1]()
  %1852 : int = prim::Constant[value=2]()
  %1853 : Tensor(*, *, *) = aten::transpose(%k6.1, %1851, %1852)
  %attn_weights17.1 : Tensor(*, *, *) = aten::bmm(%q10.1, %1853)
  %1846 : int[] = prim::ListConstruct(%bsz2.1, %1889, %tgt_len2.1, %src_len2.1)
  %attn_weights18.1 : Tensor(*, *, *, *) = aten::view(%attn_weights17.1, %1846)
  %1840 : float = prim::Constant[value=-inf]()
  %attn_weights19.1 : Tensor = aten::masked_fill(%attn_weights18.1, %2483, %1840)
  %1838 : int[] = prim::ListConstruct(%1888, %tgt_len2.1, %src_len2.1)
  %attn_weights20.1 : Tensor(*, *, *) = aten::view(%attn_weights19.1, %1838)
  %1830 : int = prim::Constant[value=-1]()
  %1831 : int = prim::Constant[value=6]()
  %ret2.2 : Tensor = aten::softmax(%attn_weights20.1, %1830, %1831)
  %attn_weights21.1 : Tensor = aten::type_as(%ret2.2, %attn_weights20.1)
  %1826 : ClassType<dropout> = prim::GetAttr[name="dropout"](%1919)
  %1825 : bool = prim::GetAttr[name="training"](%1826)
  %1821 : float = prim::Constant[value=0.1]()
  %attn_weights22.2 : Tensor = aten::dropout(%attn_weights21.1, %1821, %1825)
  %attn5.1 : Tensor(*, *, *) = aten::bmm(%attn_weights22.2, %v6.1)
  %1814 : int = prim::Constant[value=0]()
  %1815 : int = prim::Constant[value=1]()
  %1816 : Tensor(*, *, *) = aten::transpose(%attn5.1, %1814, %1815)
  %1811 : int = prim::Constant[value=0]()
  %1812 : Tensor(*, *, *) = aten::contiguous(%1816, %1811)
  %1809 : int[] = prim::ListConstruct(%tgt_len2.1, %bsz2.1, %embed_dim2.1)
  %attn6.1 : Tensor(*, *, *) = aten::view(%1812, %1809)
  %1802 : ClassType<output_projection> = prim::GetAttr[name="output_projection"](%1919)
  %1800 : Float(*, *) = prim::GetAttr[name="weight"](%1802)
  %1799 : Float(*) = prim::GetAttr[name="bias"](%1802)
  %1797 : Float(*, *) = aten::t(%1800)
  %output25.1 : Tensor(*, *, *) = aten::matmul(%attn6.1, %1797)
  %1791 : int = prim::Constant[value=1]()
  %output26.1 : Tensor = aten::add_(%output25.1, %1799, %1791)
  %1788 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2573)
  %1787 : bool = prim::GetAttr[name="training"](%1788)
  %1783 : float = prim::Constant[value=0.1]()
  %attention6.2 : Tensor = aten::dropout(%output26.1, %1783, %1787)
  %1780 : int = prim::Constant[value=1]()
  %biased_input5.1 : Tensor = aten::add(%encoded2.1, %attention6.2, %1780)
  %1777 : ClassType<attention_layer_norm> = prim::GetAttr[name="attention_layer_norm"](%2573)
  %1776 : Float(*) = prim::GetAttr[name="weight"](%1777)
  %1775 : Float(*) = prim::GetAttr[name="bias"](%1777)
  %1768 : int[] = prim::Constant[value=[768]]()
  %1771 : float = prim::Constant[value=1e-05]()
  %1772 : bool = prim::Constant[value=1]()
  %biased_input6.1 : Tensor = aten::layer_norm(%biased_input5.1, %1768, %1776, %1775, %1771, %1772)
  %1766 : ClassType<residual_mlp> = prim::GetAttr[name="residual_mlp"](%2573)
  %1765 : ClassType<mlp> = prim::GetAttr[name="mlp"](%1766)
  %1763 : ClassType<_0> = prim::GetAttr[name="0"](%1765)
  %1762 : ClassType<_2> = prim::GetAttr[name="2"](%1765)
  %1761 : ClassType<_3> = prim::GetAttr[name="3"](%1765)
  %1760 : ClassType<_4> = prim::GetAttr[name="4"](%1765)
  %1758 : Float(*, *) = prim::GetAttr[name="weight"](%1763)
  %1757 : Float(*) = prim::GetAttr[name="bias"](%1763)
  %1753 : int = prim::Constant[value=2]()
  %1754 : int = prim::Constant[value=1]()
  %input13 : Tensor = glow::fused_linear(%biased_input6.1, %1758, %1757, %1753, %1754)
  %1749 : bool = prim::Constant[value=0]()
  %1750 : FloatTensor = aten::_cast_Float(%input13, %1749)
  %1748 : FloatTensor = aten::gelu(%1750)
  %input14.1 : Tensor = aten::type_as(%1748, %input13)
  %1743 : bool = prim::GetAttr[name="training"](%1762)
  %1739 : float = prim::Constant[value=0.1]()
  %input15.2 : Tensor = aten::dropout(%input14.1, %1739, %1743)
  %1737 : Float(*, *) = prim::GetAttr[name="weight"](%1761)
  %1736 : Float(*) = prim::GetAttr[name="bias"](%1761)
  %1732 : int = prim::Constant[value=2]()
  %1733 : int = prim::Constant[value=1]()
  %input16 : Tensor = glow::fused_linear(%input15.2, %1737, %1736, %1732, %1733)
  %1728 : bool = prim::GetAttr[name="training"](%1760)
  %1724 : float = prim::Constant[value=0.1]()
  %bias34.2 : Tensor = aten::dropout(%input16, %1724, %1728)
  %1721 : int = prim::Constant[value=1]()
  %biased2.1 : Tensor = aten::add(%biased_input6.1, %bias34.2, %1721)
  %1718 : ClassType<final_layer_norm> = prim::GetAttr[name="final_layer_norm"](%2573)
  %1716 : Float(*) = prim::GetAttr[name="weight"](%1718)
  %1715 : Float(*) = prim::GetAttr[name="bias"](%1718)
  %1708 : int[] = prim::Constant[value=[768]]()
  %1711 : float = prim::Constant[value=1e-05]()
  %1712 : bool = prim::Constant[value=1]()
  %encoded3.1 : Tensor = aten::layer_norm(%biased2.1, %1708, %1716, %1715, %1711, %1712)
  %1706 : ClassType<attention> = prim::GetAttr[name="attention"](%2572)
  %1705 : int[] = aten::size(%encoded3.1)
  %tgt_len3.1 : int, %bsz3.1 : int, %embed_dim3.1 : int = prim::ListUnpack(%1705)
  %1700 : int[] = aten::size(%208)
  %mask_bsz3.1 : int, %src_len3.1 : int = prim::ListUnpack(%1700)
  %1696 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%1706)
  %1695 : Float(*, *) = prim::GetAttr[name="weight"](%1696)
  %1694 : Float(*) = prim::GetAttr[name="bias"](%1696)
  %1690 : int = prim::Constant[value=2]()
  %1691 : int = prim::Constant[value=1]()
  %projection3 : Tensor = glow::fused_linear(%encoded3.1, %1695, %1694, %1690, %1691)
  %1685 : Tensor, %1686 : Tensor, %1687 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection3)
  %1683 : float = prim::GetAttr[name="scaling"](%1706)
  %q12.1 : Tensor = aten::mul_(%1685, %1683)
  %1678 : int = prim::Constant[value=0]()
  %1679 : Tensor = aten::contiguous(%q12.1, %1678)
  %1676 : int = prim::GetAttr[name="num_heads"](%1706)
  %1675 : int = aten::mul(%bsz3.1, %1676)
  %1674 : int = prim::GetAttr[name="head_dim"](%1706)
  %1673 : int[] = prim::ListConstruct(%tgt_len3.1, %1675, %1674)
  %1672 : Tensor(*, *, *) = aten::view(%1679, %1673)
  %1667 : int = prim::Constant[value=0]()
  %1668 : int = prim::Constant[value=1]()
  %q13.1 : Tensor(*, *, *) = aten::transpose(%1672, %1667, %1668)
  %1664 : int = prim::Constant[value=0]()
  %1665 : Tensor = aten::contiguous(%1686, %1664)
  %1661 : int = prim::Constant[value=-1]()
  %1662 : int[] = prim::ListConstruct(%1661, %1675, %1674)
  %1660 : Tensor(*, *, *) = aten::view(%1665, %1662)
  %1655 : int = prim::Constant[value=0]()
  %1656 : int = prim::Constant[value=1]()
  %k8.1 : Tensor(*, *, *) = aten::transpose(%1660, %1655, %1656)
  %1652 : int = prim::Constant[value=0]()
  %1653 : Tensor = aten::contiguous(%1687, %1652)
  %1648 : int = prim::Constant[value=-1]()
  %1650 : int[] = prim::ListConstruct(%1648, %1675, %1674)
  %1647 : Tensor(*, *, *) = aten::view(%1653, %1650)
  %1642 : int = prim::Constant[value=0]()
  %1643 : int = prim::Constant[value=1]()
  %v8.1 : Tensor(*, *, *) = aten::transpose(%1647, %1642, %1643)
  %1638 : int = prim::Constant[value=1]()
  %1639 : int = prim::Constant[value=2]()
  %1640 : Tensor(*, *, *) = aten::transpose(%k8.1, %1638, %1639)
  %attn_weights23.1 : Tensor(*, *, *) = aten::bmm(%q13.1, %1640)
  %1633 : int[] = prim::ListConstruct(%bsz3.1, %1676, %tgt_len3.1, %src_len3.1)
  %attn_weights24.1 : Tensor(*, *, *, *) = aten::view(%attn_weights23.1, %1633)
  %1627 : float = prim::Constant[value=-inf]()
  %attn_weights25.1 : Tensor = aten::masked_fill(%attn_weights24.1, %2483, %1627)
  %1625 : int[] = prim::ListConstruct(%1675, %tgt_len3.1, %src_len3.1)
  %attn_weights26.1 : Tensor(*, *, *) = aten::view(%attn_weights25.1, %1625)
  %1617 : int = prim::Constant[value=-1]()
  %1618 : int = prim::Constant[value=6]()
  %ret3.2 : Tensor = aten::softmax(%attn_weights26.1, %1617, %1618)
  %attn_weights27.1 : Tensor = aten::type_as(%ret3.2, %attn_weights26.1)
  %1613 : ClassType<dropout> = prim::GetAttr[name="dropout"](%1706)
  %1612 : bool = prim::GetAttr[name="training"](%1613)
  %1608 : float = prim::Constant[value=0.1]()
  %attn_weights28.2 : Tensor = aten::dropout(%attn_weights27.1, %1608, %1612)
  %attn7.1 : Tensor(*, *, *) = aten::bmm(%attn_weights28.2, %v8.1)
  %1601 : int = prim::Constant[value=0]()
  %1602 : int = prim::Constant[value=1]()
  %1603 : Tensor(*, *, *) = aten::transpose(%attn7.1, %1601, %1602)
  %1598 : int = prim::Constant[value=0]()
  %1599 : Tensor(*, *, *) = aten::contiguous(%1603, %1598)
  %1596 : int[] = prim::ListConstruct(%tgt_len3.1, %bsz3.1, %embed_dim3.1)
  %attn8.1 : Tensor(*, *, *) = aten::view(%1599, %1596)
  %1589 : ClassType<output_projection> = prim::GetAttr[name="output_projection"](%1706)
  %1587 : Float(*, *) = prim::GetAttr[name="weight"](%1589)
  %1586 : Float(*) = prim::GetAttr[name="bias"](%1589)
  %1584 : Float(*, *) = aten::t(%1587)
  %output33.1 : Tensor(*, *, *) = aten::matmul(%attn8.1, %1584)
  %1578 : int = prim::Constant[value=1]()
  %output34.1 : Tensor = aten::add_(%output33.1, %1586, %1578)
  %1575 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2572)
  %1574 : bool = prim::GetAttr[name="training"](%1575)
  %1570 : float = prim::Constant[value=0.1]()
  %attention8.2 : Tensor = aten::dropout(%output34.1, %1570, %1574)
  %1567 : int = prim::Constant[value=1]()
  %biased_input7.1 : Tensor = aten::add(%encoded3.1, %attention8.2, %1567)
  %1564 : ClassType<attention_layer_norm> = prim::GetAttr[name="attention_layer_norm"](%2572)
  %1563 : Float(*) = prim::GetAttr[name="weight"](%1564)
  %1562 : Float(*) = prim::GetAttr[name="bias"](%1564)
  %1555 : int[] = prim::Constant[value=[768]]()
  %1558 : float = prim::Constant[value=1e-05]()
  %1559 : bool = prim::Constant[value=1]()
  %biased_input8.1 : Tensor = aten::layer_norm(%biased_input7.1, %1555, %1563, %1562, %1558, %1559)
  %1553 : ClassType<residual_mlp> = prim::GetAttr[name="residual_mlp"](%2572)
  %1552 : ClassType<mlp> = prim::GetAttr[name="mlp"](%1553)
  %1550 : ClassType<_0> = prim::GetAttr[name="0"](%1552)
  %1549 : ClassType<_2> = prim::GetAttr[name="2"](%1552)
  %1548 : ClassType<_3> = prim::GetAttr[name="3"](%1552)
  %1547 : ClassType<_4> = prim::GetAttr[name="4"](%1552)
  %1545 : Float(*, *) = prim::GetAttr[name="weight"](%1550)
  %1544 : Float(*) = prim::GetAttr[name="bias"](%1550)
  %1540 : int = prim::Constant[value=2]()
  %1541 : int = prim::Constant[value=1]()
  %input17 : Tensor = glow::fused_linear(%biased_input8.1, %1545, %1544, %1540, %1541)
  %1536 : bool = prim::Constant[value=0]()
  %1537 : FloatTensor = aten::_cast_Float(%input17, %1536)
  %1535 : FloatTensor = aten::gelu(%1537)
  %input18.1 : Tensor = aten::type_as(%1535, %input17)
  %1530 : bool = prim::GetAttr[name="training"](%1549)
  %1526 : float = prim::Constant[value=0.1]()
  %input19.2 : Tensor = aten::dropout(%input18.1, %1526, %1530)
  %1524 : Float(*, *) = prim::GetAttr[name="weight"](%1548)
  %1523 : Float(*) = prim::GetAttr[name="bias"](%1548)
  %1519 : int = prim::Constant[value=2]()
  %1520 : int = prim::Constant[value=1]()
  %input20 : Tensor = glow::fused_linear(%input19.2, %1524, %1523, %1519, %1520)
  %1515 : bool = prim::GetAttr[name="training"](%1547)
  %1511 : float = prim::Constant[value=0.1]()
  %bias43.2 : Tensor = aten::dropout(%input20, %1511, %1515)
  %1508 : int = prim::Constant[value=1]()
  %biased3.1 : Tensor = aten::add(%biased_input8.1, %bias43.2, %1508)
  %1505 : ClassType<final_layer_norm> = prim::GetAttr[name="final_layer_norm"](%2572)
  %1503 : Float(*) = prim::GetAttr[name="weight"](%1505)
  %1502 : Float(*) = prim::GetAttr[name="bias"](%1505)
  %1495 : int[] = prim::Constant[value=[768]]()
  %1498 : float = prim::Constant[value=1e-05]()
  %1499 : bool = prim::Constant[value=1]()
  %encoded4.1 : Tensor = aten::layer_norm(%biased3.1, %1495, %1503, %1502, %1498, %1499)
  %1493 : ClassType<attention> = prim::GetAttr[name="attention"](%2571)
  %1492 : int[] = aten::size(%encoded4.1)
  %tgt_len4.1 : int, %bsz4.1 : int, %embed_dim4.1 : int = prim::ListUnpack(%1492)
  %1487 : int[] = aten::size(%208)
  %mask_bsz4.1 : int, %src_len4.1 : int = prim::ListUnpack(%1487)
  %1483 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%1493)
  %1482 : Float(*, *) = prim::GetAttr[name="weight"](%1483)
  %1481 : Float(*) = prim::GetAttr[name="bias"](%1483)
  %1477 : int = prim::Constant[value=2]()
  %1478 : int = prim::Constant[value=1]()
  %projection4 : Tensor = glow::fused_linear(%encoded4.1, %1482, %1481, %1477, %1478)
  %1472 : Tensor, %1473 : Tensor, %1474 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection4)
  %1470 : float = prim::GetAttr[name="scaling"](%1493)
  %q15.1 : Tensor = aten::mul_(%1472, %1470)
  %1465 : int = prim::Constant[value=0]()
  %1466 : Tensor = aten::contiguous(%q15.1, %1465)
  %1463 : int = prim::GetAttr[name="num_heads"](%1493)
  %1462 : int = aten::mul(%bsz4.1, %1463)
  %1461 : int = prim::GetAttr[name="head_dim"](%1493)
  %1460 : int[] = prim::ListConstruct(%tgt_len4.1, %1462, %1461)
  %1459 : Tensor(*, *, *) = aten::view(%1466, %1460)
  %1454 : int = prim::Constant[value=0]()
  %1455 : int = prim::Constant[value=1]()
  %q16.1 : Tensor(*, *, *) = aten::transpose(%1459, %1454, %1455)
  %1451 : int = prim::Constant[value=0]()
  %1452 : Tensor = aten::contiguous(%1473, %1451)
  %1448 : int = prim::Constant[value=-1]()
  %1449 : int[] = prim::ListConstruct(%1448, %1462, %1461)
  %1447 : Tensor(*, *, *) = aten::view(%1452, %1449)
  %1442 : int = prim::Constant[value=0]()
  %1443 : int = prim::Constant[value=1]()
  %k10.1 : Tensor(*, *, *) = aten::transpose(%1447, %1442, %1443)
  %1439 : int = prim::Constant[value=0]()
  %1440 : Tensor = aten::contiguous(%1474, %1439)
  %1435 : int = prim::Constant[value=-1]()
  %1437 : int[] = prim::ListConstruct(%1435, %1462, %1461)
  %1434 : Tensor(*, *, *) = aten::view(%1440, %1437)
  %1429 : int = prim::Constant[value=0]()
  %1430 : int = prim::Constant[value=1]()
  %v10.1 : Tensor(*, *, *) = aten::transpose(%1434, %1429, %1430)
  %1425 : int = prim::Constant[value=1]()
  %1426 : int = prim::Constant[value=2]()
  %1427 : Tensor(*, *, *) = aten::transpose(%k10.1, %1425, %1426)
  %attn_weights29.1 : Tensor(*, *, *) = aten::bmm(%q16.1, %1427)
  %1420 : int[] = prim::ListConstruct(%bsz4.1, %1463, %tgt_len4.1, %src_len4.1)
  %attn_weights30.1 : Tensor(*, *, *, *) = aten::view(%attn_weights29.1, %1420)
  %1414 : float = prim::Constant[value=-inf]()
  %attn_weights31.1 : Tensor = aten::masked_fill(%attn_weights30.1, %2483, %1414)
  %1412 : int[] = prim::ListConstruct(%1462, %tgt_len4.1, %src_len4.1)
  %attn_weights32.1 : Tensor(*, *, *) = aten::view(%attn_weights31.1, %1412)
  %1404 : int = prim::Constant[value=-1]()
  %1405 : int = prim::Constant[value=6]()
  %ret4.2 : Tensor = aten::softmax(%attn_weights32.1, %1404, %1405)
  %attn_weights33.1 : Tensor = aten::type_as(%ret4.2, %attn_weights32.1)
  %1400 : ClassType<dropout> = prim::GetAttr[name="dropout"](%1493)
  %1399 : bool = prim::GetAttr[name="training"](%1400)
  %1395 : float = prim::Constant[value=0.1]()
  %attn_weights34.2 : Tensor = aten::dropout(%attn_weights33.1, %1395, %1399)
  %attn9.1 : Tensor(*, *, *) = aten::bmm(%attn_weights34.2, %v10.1)
  %1388 : int = prim::Constant[value=0]()
  %1389 : int = prim::Constant[value=1]()
  %1390 : Tensor(*, *, *) = aten::transpose(%attn9.1, %1388, %1389)
  %1385 : int = prim::Constant[value=0]()
  %1386 : Tensor(*, *, *) = aten::contiguous(%1390, %1385)
  %1383 : int[] = prim::ListConstruct(%tgt_len4.1, %bsz4.1, %embed_dim4.1)
  %attn10.1 : Tensor(*, *, *) = aten::view(%1386, %1383)
  %1376 : ClassType<output_projection> = prim::GetAttr[name="output_projection"](%1493)
  %1374 : Float(*, *) = prim::GetAttr[name="weight"](%1376)
  %1373 : Float(*) = prim::GetAttr[name="bias"](%1376)
  %1371 : Float(*, *) = aten::t(%1374)
  %output41.1 : Tensor(*, *, *) = aten::matmul(%attn10.1, %1371)
  %1365 : int = prim::Constant[value=1]()
  %output42.1 : Tensor = aten::add_(%output41.1, %1373, %1365)
  %1362 : ClassType<dropout> = prim::GetAttr[name="dropout"](%2571)
  %1361 : bool = prim::GetAttr[name="training"](%1362)
  %1357 : float = prim::Constant[value=0.1]()
  %attention10.2 : Tensor = aten::dropout(%output42.1, %1357, %1361)
  %1354 : int = prim::Constant[value=1]()
  %biased_input9.1 : Tensor = aten::add(%encoded4.1, %attention10.2, %1354)
  %1351 : ClassType<attention_layer_norm> = prim::GetAttr[name="attention_layer_norm"](%2571)
  %1350 : Float(*) = prim::GetAttr[name="weight"](%1351)
  %1349 : Float(*) = prim::GetAttr[name="bias"](%1351)
  %1342 : int[] = prim::Constant[value=[768]]()
  %1345 : float = prim::Constant[value=1e-05]()
  %1346 : bool = prim::Constant[value=1]()
  %biased_input10.1 : Tensor = aten::layer_norm(%biased_input9.1, %1342, %1350, %1349, %1345, %1346)
  %1340 : ClassType<residual_mlp> = prim::GetAttr[name="residual_mlp"](%2571)
  %1339 : ClassType<mlp> = prim::GetAttr[name="mlp"](%1340)
  %1337 : ClassType<_0> = prim::GetAttr[name="0"](%1339)
  %1336 : ClassType<_2> = prim::GetAttr[name="2"](%1339)
  %1335 : ClassType<_3> = prim::GetAttr[name="3"](%1339)
  %1334 : ClassType<_4> = prim::GetAttr[name="4"](%1339)
  %1332 : Float(*, *) = prim::GetAttr[name="weight"](%1337)
  %1331 : Float(*) = prim::GetAttr[name="bias"](%1337)
  %1327 : int = prim::Constant[value=2]()
  %1328 : int = prim::Constant[value=1]()
  %input21 : Tensor = glow::fused_linear(%biased_input10.1, %1332, %1331, %1327, %1328)
  %1323 : bool = prim::Constant[value=0]()
  %1324 : FloatTensor = aten::_cast_Float(%input21, %1323)
  %1322 : FloatTensor = aten::gelu(%1324)
  %input22.1 : Tensor = aten::type_as(%1322, %input21)
  %1317 : bool = prim::GetAttr[name="training"](%1336)
  %1313 : float = prim::Constant[value=0.1]()
  %input23.2 : Tensor = aten::dropout(%input22.1, %1313, %1317)
  %1311 : Float(*, *) = prim::GetAttr[name="weight"](%1335)
  %1310 : Float(*) = prim::GetAttr[name="bias"](%1335)
  %1306 : int = prim::Constant[value=2]()
  %1307 : int = prim::Constant[value=1]()
  %input24 : Tensor = glow::fused_linear(%input23.2, %1311, %1310, %1306, %1307)
  %1302 : bool = prim::GetAttr[name="training"](%1334)
  %1298 : float = prim::Constant[value=0.1]()
  %bias52.2 : Tensor = aten::dropout(%input24, %1298, %1302)
  %1295 : int = prim::Constant[value=1]()
  %biased4.1 : Tensor = aten::add(%biased_input10.1, %bias52.2, %1295)
  %1292 : ClassType<final_layer_norm> = prim::GetAttr[name="final_layer_norm"](%2571)
  %1290 : Float(*) = prim::GetAttr[name="weight"](%1292)
  %1289 : Float(*) = prim::GetAttr[name="bias"](%1292)
  %1282 : int[] = prim::Constant[value=[768]]()
  %1285 : float = prim::Constant[value=1e-05]()
  %1286 : bool = prim::Constant[value=1]()
  %encoded5.1 : Tensor = aten::layer_norm(%biased4.1, %1282, %1290, %1289, %1285, %1286)
  %1280 : ClassType<attention> = prim::GetAttr[name="attention"](%2570)
  %1279 : int[] = aten::size(%encoded5.1)
  %tgt_len5.1 : int, %bsz5.1 : int, %embed_dim5.1 : int = prim::ListUnpack(%1279)
  %1274 : int[] = aten::size(%208)
  %mask_bsz5.1 : int, %src_len5.1 : int = prim::ListUnpack(%1274)
  %1270 : ClassType<input_projection> = prim::GetAttr[name="input_projection"](%1280)
  %1269 : Float(*, *) = prim::GetAttr[name="weight"](%1270)
  %1268 : Float(*) = prim::GetAttr[name="bias"](%1270)
  %1264 : int = prim::Constant[value=2]()
  %1265 : int = prim::Constant[value=1]()
  %projection5 : Tensor = glow::fused_linear(%encoded5.1, %1269, %1268, %1264, %1265)
  %1259 : Tensor, %1260 : Tensor, %1261 : Tensor = prim::ConstantChunk[chunks=3, dim=-1](%projection5)
  %1257 : float = prim::GetAttr[name="scaling"](%1280)
  %q18.1 : Tensor = aten::mul_(%1259, %1257)
  %1252 : int = prim::Constant[value=0]()
  %1253 : Tensor = aten::contiguous(%q18.1, %1252)
  %1250 : int = prim::GetAttr[name="num_heads"](%1280)
  %1249 : int = aten::mul(%bsz5.1, %1250)
  %1248 : int = prim::GetAttr[name="head_dim"](%1280)
  %1247 : int[] = prim::ListConstruct(%tgt_len5.1, %1249, %1248)
  %1246 : Tensor(*, *, *) = aten::view(%1253, %1247)
  %1241 : int = prim::Constant[value=0]()
  %1242 : int = prim::Constant[value=1]()
  %q19.1 : Tensor(*, *, *) = aten::transpose(%1246, %1241, %1242)
  %1238 : int = prim::Constant[value=0]()
  %1239 : Tensor = aten::contiguous(%1260, %1238)
  %1235 : int = prim::Constant[value=-1]()
  %1236 : int[] = prim::ListConstruct(%1235, %1249, %1248)
  %1234 : Tensor(*, *, *) = aten::view(%1239, %1236)
  %1229 : int = prim::Constant[value=0]()
  %1230 : int = prim::Constant[value=1]()
  %k12.1 : Tensor(*, *, *) = aten::transpose(%1234, %1229, %1230)
  %1226 : int = prim::Constant[value=0]()
  %1227 : Tensor = aten::contiguous(%1261, %1226)
  %1222 : int = prim::Constant[value=-1]()
  %1224 : int[] = prim::ListConstruct(%1222, %1249, %1248)
  %1221 : Tensor(*, *, *) = aten::view(%1227, %1224)
  %1216 : int = prim::Constant[value=0]()
  %1217 : int = prim::Constant[value=1]()
  %v12.1 : Tensor(*, *, *) = aten::transpose(%1221, %1216, %1217)
  %1212 : int = prim::Constant[value=1]()
  %1213 : int = prim::Constant[value=2]()
  %1214 : Tensor(*, *, *) = aten::transpose(%k12.1, %1212, %1213)
  %attn_weights35.1 : Tensor(*, *, *) = aten::bmm(%q19.1, %1214)
  %1207 : int[] = prim::ListConstruct(%bsz5.1, %1250, %tgt_len5.1, %src_len5.1)
  %attn_weights36.1 : Tensor(*, *, *, *) = aten::view(%attn_weights35.1, %1207)
  %1201 : float = prim::Constant[value=-inf]()
  %attn_weights37.1 : Tensor = aten::masked_fill(%attn_weights36.1, %2483, %1201)
  %1199 : int[] = prim::ListConstruct(%1249, %tgt_len5.1, %src_len5.1)
  %attn_weights38.1 : Tensor(*, *, *) = aten::view(%attn_weights37.1, %1199)
  %1191 : int = prim::Constant[value=-1]()
  %1192 : int = prim::Constant[value=6]()
  %ret5.2 : Tensor = aten::softmax(%attn_weights38.1, %1191, %1192)
  %attn_weights39.1 : Tensor = aten::type_as(%ret5.2, %attn_weights38.1)
  %1187 : ClassType<dropout> = prim::GetAttr[name="dropout"](%1280)
  %1186 : bool = prim::GetAttr[name="training"](%1187)
  %1182 : float = prim::Constant[value=0.1]()
  %attn_weights40.2 : Tensor = aten::dropout(%attn_weights39.1, %1182, %1186)
  %attn11.1 : Tensor(*, *, *) = aten::bmm(%attn_weights40.2, %v12.1)
  %1175 : int = prim::Constant[value=0]()
